---
kind: method
id: M:Autodesk.Revit.DB.GeomCombinationSet.ReverseIterator
source: html/fd75e1f3-a3bd-24ce-ee16-7074354b88f4.htm
---
# Autodesk.Revit.DB.GeomCombinationSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual GeomCombinationSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.